= 前書き

「ぶいちゃインフラ合同！」を手に取っていただき、ありがとうございます。

本書は、VRChatとインターネット、その基盤を支える技術やコミュニティを題材にした、honahukuとnirilaによる合同誌です。VRChatで技術コミュニティを続けること、そしてインターネット上の技術を組み合わせてものを作ること。それぞれの視点から、私たちが実際に取り組んできたことや、そこで考えたことを紹介します。



==[notoc] 免責事項

本書に記載された内容は、情報の提供のみを目的としています。したがって、本書を用いた開発、製作、運用は、必ずご自身の責任と判断によって行ってください。
これらの情報による開発、製作、運用の結果について、各著者はいかなる責任も負いません。

== 著者紹介

@<icon>{honahuku} @<b>{honahuku}

分散システム、ネットワーク、可観測性、インフラ自動化に関心を持っている。SF、百合、青春もの、サカナクション、街歩き、ジン、甘い日本酒が好き。第1章「VRChatで分散システム集会を2年ほど続けている」第3章「ツクヨミはマンションの一室で動かせるのか？」を執筆。

//blankline
//blankline

@<icon>{nirila} @<b>{nirila}

Webバックエンド,Unityエンジニア。VRChatを中心に活動しながら、分散SNSの運営や自宅サーバーの構築などを行っている。自分の好きなことを形作ることに関心があり、第2章「インターネットという積み木で遊ぼう」第4章「VRChatコミュニティを支えるMisskeyインフラ」を執筆。
